Repository: OpenPecha-Data/d362ad59ce4e468d99befa4941cb4474
Catalog: *.po
Languages: bo

source: Homage to all buddhas and bodhisattvas.
bo: སངས་རྒྱས་ དང་ བྱང་ཆུབ་ སེམས་དཔའ་ ཐམས་ཅད་ ལ་ ཕྱག་ འཚལ་ ལོ་ །

source: Thus have I heard at one time.
bo: འདི་སྐད་ བདག་ གིས་ ཐོས་པ་ དུས་ གཅིག་ ན་ །

source: The Blessed One was dwelling in Rājagṛha at Vulture Peak Mountain together with a saṅgha of , monks and five thousand eminently famous bodhisattva mahāsattvas who had attained the superknowledges,
bo: བཅོམ་ལྡན་འདས་ རྒྱལ་པོ་ -འི་ ཁབ་ ན་ བྱ་རྒོད་ ཀྱི་ ཕུང་པོ་ -འི་ རི་ ལ་ ། དགེ་སློང་ སྟོང་ ཉིས་ བརྒྱ་ ལྔ་ བཅུ་ -འི་ དགེ་སློང་ གི་ དགེ་འདུན་ ཆེན་པོ་ དང་ ། བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ མངོན་པར་ གྲགས་པ་ ། མངོན་པར་ གྲགས་པ་ མངོན་པར་ ཤེས་པ་ ཐོབ་པ་ །

source: the retentions,
bo: གཟུངས་ཐོབ་པ་ །

source: the miraculous power of magical display,
bo: རྫུ་འཕྲུལ་ གྱི་ ཆོ་འཕྲུལ་ ཐོབ་པ་ །

source: and acceptance that phenomena are unborn
bo: མི་ སྐྱེ་བ་ -འི་ ཆོས་ ལ་ བཟོད་པ་ ཐོབ་པ་ ལྔ་ སྟོང་ ལ་ འདི་ལྟ་སྟེ་ །

source: —famous ones such as the bodhisattva mahāsattva Siṃha,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེང་གེ་ དང་ །

source: the bodhisattva mahāsattva Siṃhamati,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེང་གེ་ བློ་གྲོས་ དང་ །

source: the bodhisattva mahāsattva Fine Sandalwood,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཙན་དན་ བཟང་པོ་ དང་ །

source: the bodhisattva mahāsattva Sārathi,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཁ་ལོ་ སྒྱུར་བ་ དང་ །

source: the bodhisattva mahāsattva Mahāsārathi,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཁ་ལོ་ སྒྱུར་བ་ ཆེན་པོ་ དང་ །

source: the bodhisattva mahāsattva Prabhāśrī,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ འོད་ དཔལ་ དང་ །

source: the bodhisattva mahāsattva Radiant,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ འོད་བྱེད་ དང་ །

source: the bodhisattva mahāsattva Endowed with Brilliant Light and Having a Melodious Voice,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ འོད་ གཟི་བརྗིད་ དང་ ལྡན་ ཞིང་ ང་རོ་ སྙན་པ་ དང་ །

source: the bodhisattva mahāsattva Prabhāvyūha,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ འོད་ བཀོད་པ་ དང་ །

source: the bodhisattva mahāsattva Clear Mind,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ བློ་གསལ་ དང་ །

source: the bodhisattva mahāsattva Essence of Beings,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་ཅན་ གྱི་ སྙིང་པོ་ དང་ །

source: the bodhisattva mahāsattva Disciplined Charioteer of Beings,
bo: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་ཅན་ ཁ་ལོ་ སྒྱུར་བ་ དུལ་བ་ དང་ ལྡན་པ་ དང་ །

source: all the bodhisattva mahāsattvas of the Fortunate Eon,
bo: བྱམས་པ་ ལ་སོགས་པ་ བསྐལ་པ་ བཟང་པོ་ -འི་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ཐམས་ཅད་ དང་ །

source: such as Maitreya,
bo: འཇམ་དཔལ་ གཞོན་ནུ་ -ར་ གྱུར་པ་ དང་ །

source: and other bodhisattvas such as Mañjuśrīkumārabhūta and so forth.
bo: དེ་དག་ ལ་སོགས་པ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ ལྔ་ སྟོང་ དང་ ཐབས་ཅིག་ ཏུ་ བཞུགས་ ཏེ་ །
